const plantSamplesData = {
    forestry: [
        // عينات الحراج سيتم إضافتها هنا لاحقاً
    ],
    ornamental: [
        {
            image: "https://i.postimg.cc/GtD1VJcM/IMG-20261030-122729.jpg",
            title: "الليغستروم - حناء الأسيجة",
            description: "الاسم العلمي: Ligustrum vulgaris\nشجيرة مزهرة، دائمة الخضرة، يتحمل القص والتشكيل، قابل للقطف التجاري وصناعة الباقات الجافة، يزهر أول الربيع أزهاره بيضاء عنقودية، يتحمل الصقيع، يتكاثر بالعقل الساقية. 🌹"
        },
        {
            image: "https://i.postimg.cc/ydgq3X3r/IMG-20261030-123059.jpg",
            title: "المرجان",
            description: "الاسم العلمي: Euonymus japonicus\nشجيرة مزهرة دائمة الخضرة، يتحمل القص والتشكيل، قابل للقطف التجاري وصناعة الباقات الجافة، يزهر أول الربيع والأزهار صغيرة صفراء مخضرة تتحول لثمار حمراء، يتكاثر بالعقل الساقية. 🌹"
        },
        {
            image: "https://i.postimg.cc/Rh7DwPSk/IMG-20261030-123242.jpg",
            title: "أم كلثوم - الديس الافرنجي",
            description: "الاسم العلمي: Lantana camara\nشجيرة تزيينية مزهرة يتراوح ارتفاعها بين 1 إلى 1,5 م - مستديمة الخضرة، يتحمل القص والتشكيل، غير قابل للقطف التجاري وصناعة الباقات الجافة طريقة التكاثر: بالعقل الساقية - موعد الإزهار من أول الربيع تعطي مجاميع زهرية مختلفة الألوان تتراوح بين الأحمر والأصفر والبرتقالي والأبيض وتحول لثمار سوداء. 🌹"
        },
        {
            image: "https://i.postimg.cc/8PTyqmPC/IMG-20261030-123426.jpg",
            title: "العفص الشرقي",
            description: "الاسم العلمي: Biota Orientalis\nشجيرة مستديمة الخضرة، الأوراق خضراء أو مصفرة والثمار مخاريط صغيرة ذات ثماني حواف، طريقة التكاثر: بالعقل الساقية والبذور، تتحمل عمليات القص والتشكيل، قابل للقطف التجاري وصناعة الباقات الجافة. 🌹"
        }
    ]
};
