const plantSamplesData = {
    forestry: [
        // عينات الحراج سيتم إضافتها هنا لاحقاً
    ],
    ornamental: [
        {
            image: "https://imgur.com/a/LACjlGc",
            title: "الليغستروم - حناء الأسيجة",
            description: "الاسم العلمي: Ligustrum vulgaris\nشجيرة مزهرة، دائمة الخضرة، يتحمل القص والتشكيل، قابل للقطف التجاري وصناعة الباقات الجافة، يزهر أول الربيع أزهاره بيضاء عنقودية، يتحمل الصقيع، يتكاثر بالعقل الساقية. 🌹"
        },
        {
            image: "https://imgur.com/a/LACjlGc",
            title: "المرجان",
            description: "الاسم العلمي: Euonymus japonicus\nشجيرة مزهرة دائمة الخضرة، يتحمل القص والتشكيل، قابل للقطف التجاري وصناعة الباقات الجافة، يزهر أول الربيع والأزهار صغيرة صفراء مخضرة تتحول لثمار حمراء، يتكاثر بالعقل الساقية. 🌹"
        },
        {
            image: "https://imgur.com/a/LACjlGc",
            title: "أم كلثوم - الديس الافرنجي",
            description: "الاسم العلمي: Lantana camara\nشجيرة تزيينية مزهرة يتراوح ارتفاعها بين 1 إلى 1,5 م - مستديمة الخضرة، يتحمل القص والتشكيل، غير قابل للقطف التجاري وصناعة الباقات الجافة طريقة التكاثر: بالعقل الساقية - موعد الإزهار من أول الربيع تعطي مجاميع زهرية مختلفة الألوان تتراوح بين الأحمر والأصفر والبرتقالي والأبيض وتحول لثمار سوداء. 🌹"
        }
    ]
};
